tutorials/pimpleHFDIBFoam/Immersed_Cyl_Oscil_IBCoef_Effect/ImmersedCyl-Sin-Re39-Mesh56320-IBPt8/system/blockMeshDictOld
/*--------------------------------*- C++ -*----------------------------------*\
|  OF8 blockMeshDict: channel with filled centre (no hole)                    |
|  Total cells = 220                                                         |
|  Cylinder (immersed later): centre (1.1 0.2 0.05), radius 0.05              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// Coordinates (same as your original)
vertices
(
    // z = 0 plane
    (0      0        0)   //  0  x0 y0
    (0      0.16464466094067265 0) //  1  x0 y1
    (0      0.23535533905932737 0) //  2  x0 y2
    (0      0.41     0)   //  3  x0 y3

    (0.895  0        0)   //  4  x1 y0
    (0.895  0.16464466094067265 0) //  5  x1 y1
    (0.895  0.23535533905932737 0) //  6  x1 y2
    (0.895  0.41     0)   //  7  x1 y3

    (1.0646446609406728 0  0) //  8  x2 y0
    (1.0646446609406728 0.16464466094067265 0) //  9  x2 y1
    (1.0646446609406728 0.23535533905932737 0) // 10  x2 y2
    (1.0646446609406728 0.41 0) // 11  x2 y3

    (1.1353553390593274 0  0) // 12  x3 y0
    (1.1353553390593274 0.16464466094067265 0) // 13  x3 y1
    (1.1353553390593274 0.23535533905932737 0) // 14  x3 y2
    (1.1353553390593274 0.41 0) // 15  x3 y3

    (1.305  0        0)   // 16  x4 y0
    (1.305  0.16464466094067265 0) // 17  x4 y1
    (1.305  0.23535533905932737 0) // 18  x4 y2
    (1.305  0.41     0)   // 19  x4 y3

    (2.2    0        0)   // 20  x5 y0
    (2.2    0.16464466094067265 0) // 21  x5 y1
    (2.2    0.23535533905932737 0) // 22  x5 y2
    (2.2    0.41     0)   // 23  x5 y3

    // z = 0.1 plane (same ordering, +24)
    (0      0        0.1) // 24
    (0      0.16464466094067265 0.1) // 25
    (0      0.23535533905932737 0.1) // 26
    (0      0.41     0.1) // 27

    (0.895  0        0.1) // 28
    (0.895  0.16464466094067265 0.1) // 29
    (0.895  0.23535533905932737 0.1) // 30
    (0.895  0.41     0.1) // 31

    (1.0646446609406728 0  0.1) // 32
    (1.0646446609406728 0.16464466094067265 0.1) // 33
    (1.0646446609406728 0.23535533905932737 0.1) // 34
    (1.0646446609406728 0.41 0.1) // 35

    (1.1353553390593274 0  0.1) // 36
    (1.1353553390593274 0.16464466094067265 0.1) // 37
    (1.1353553390593274 0.23535533905932737 0.1) // 38
    (1.1353553390593274 0.41 0.1) // 39

    (1.305  0        0.1) // 40
    (1.305  0.16464466094067265 0.1) // 41
    (1.305  0.23535533905932737 0.1) // 42
    (1.305  0.41     0.1) // 43

    (2.2    0        0.1) // 44
    (2.2    0.16464466094067265 0.1) // 45
    (2.2    0.23535533905932737 0.1) // 46
    (2.2    0.41     0.1) // 47
);

blocks
(
    // Upstream (x0-x1), split in y: (12 x 2), (12 x 1), (12 x 2)  => 60
    hex (0 4 5 1 24 28 29 25) (12 2 1) simpleGrading (1 1 1)   // y0-y1
    hex (1 5 6 2 25 29 30 26) (12 1 1) simpleGrading (1 1 1)   // y1-y2
    hex (2 6 7 3 26 30 31 27) (12 2 1) simpleGrading (1 1 1)   // y2-y3

    // Middle (x1-x4), 3x3 blocks, filled centre (no hole)
    // x1-x2: 8 cells, x2-x3: 4 cells, x3-x4: 8 cells
    // y0-y1: 2 cells, y1-y2: 1 cell, y2-y3: 2 cells  => 100 total

    // Row y0-y1
    hex (4 8 9 5 28 32 33 29)   (8 2 1) simpleGrading (1 1 1)
    hex (8 12 13 9 32 36 37 33) (4 2 1) simpleGrading (1 1 1)
    hex (12 16 17 13 36 40 41 37) (8 2 1) simpleGrading (1 1 1)

    // Row y1-y2
    hex (5 9 10 6 29 33 34 30)  (8 1 1) simpleGrading (1 1 1)
    hex (9 13 14 10 33 37 38 34) (4 1 1) simpleGrading (1 1 1)
    hex (13 17 18 14 37 41 42 38) (8 1 1) simpleGrading (1 1 1)

    // Row y2-y3
    hex (6 10 11 7 30 34 35 31) (8 2 1) simpleGrading (1 1 1)
    hex (10 14 15 11 34 38 39 35) (4 2 1) simpleGrading (1 1 1)
    hex (14 18 19 15 38 42 43 39) (8 2 1) simpleGrading (1 1 1)

    // Downstream (x4-x5), split in y same as upstream => 60
    hex (16 20 21 17 40 44 45 41) (12 2 1) simpleGrading (1 1 1)
    hex (17 21 22 18 41 45 46 42) (12 1 1) simpleGrading (1 1 1)
    hex (18 22 23 19 42 46 47 43) (12 2 1) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    name frontAndBack;
    type empty;
}

boundary
(
    left
    {
        type patch;
        faces
        (
            (0 1 25 24)
            (1 2 26 25)
            (2 3 27 26)
        );
    }

    right
    {
        type patch;
        faces
        (
            (20 44 45 21)
            (21 45 46 22)
            (22 46 47 23)
        );
    }

    up
    {
        type wall;
        faces
        (
            (3 7 31 27)
            (7 11 35 31)
            (11 15 39 35)
            (15 19 43 39)
            (19 23 47 43)
        );
    }

    down
    {
        type wall;
        faces
        (
            (0 24 28 4)
            (4 28 32 8)
            (8 32 36 12)
            (12 36 40 16)
            (16 40 44 20)
        );
    }
);

mergePatchPairs();
