tutorials/pimpleHFDIBFoam/Immersed_Cyl_Oscil_IBCoef_Effect/ImmersedCyl-Sin-Re39-Mesh56320-IBPt8/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 16;

//method  hierarchical;

method scotch;

//coeffs
//{
//    n   (4 2 2);
//}


// ************************************************************************* //
